Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd
s=pd.Series([4, 8, 15, 16, 23,42])
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
l=[1,2,3,4,5,6,7,8,9,10]
val=pd.Series(l)
print(val)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
data={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df=pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes 
(rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows
and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

Series is a type of list in pandas which can take integer values, string values, double values and more. But in Pandas Series
we return an object in the form of list, having index starting from 0 to n, Where n is the length of values in series

In [10]:
import pandas as pd

author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
auth_series = pd.Series(author)
print(auth_series)

0    Jitender
1     Purnima
2       Arpit
3       Jyoti
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [11]:
import pandas as pd

df = pd.read_csv("country_code.csv")

print(df)

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

In [12]:
df.head(10)

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
5              Andorra   AD
6               Angola   AO
7             Anguilla   AI
8           Antarctica   AQ
9  Antigua and Barbuda   AG

In [13]:
df.shape

(249, 2)

In [14]:
df.describe()

               Name Code
count           249  246
unique          249  246
top     Afghanistan   AF
freq              1    1

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series is a one-dimensional array with homogeneous data.  All the elements of series should be of same data type.
Key Features of a Series:
Homogeneous data
Size Immutable
Values of Data Mutable


DataFrame is a two-dimensional array with heterogeneous data, usually represented in the tabular format. The data is represented
in rows and columns. Each column represents an attribute and each row represents a person.
Key Features of a DataFrame:
Heterogeneous data
Size Mutable
Data Mutable


Panel is a three-dimensional data structure with heterogeneous data.

Key Features of a Panel:
Heterogeneous data
Size Mutable
Data Mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [15]:

import pandas as pd

courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])


# It  supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000